app/views/comments/_comment.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 9
---
<h3>Comments </h3>
<%= @post.comments.each do |comment| %>