app/controllers/comments_controller.rb

    def create
        @post = Post.find(params[:post_id])
        @comment = @post.comments.create(comment_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "10"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["body", "good"], ["created_at", Tue, 11 Dec 2018 07:36:21 UTC +00:00], ["post_id", 10], ["updated_at", Tue, 11 Dec 2018 07:36:21 UTC +00:00], ["username", "sahithi"]]