app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)

        if(@post.save)
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "add"], ["created_at", Mon, 10 Dec 2018 09:26:00 UTC +00:00], ["title", "sfsasdas"], ["updated_at", Mon, 10 Dec 2018 09:26:00 UTC +00:00]]